#+Title: Structure and Interpretation of Computer Programming
#+Author: Study
- website: https://mitpress.mit.edu/9780262510875/structure-and-interpretation-of-computer-programs/ 
*** LISP - Elements of programming 
- Recursive functions of symbolic expessions and their computation by machine
- John McCarthy, 1960. List Processing. Scheme in this book
- Data objects - atoms and lists
- Elements of programming - primitive expressions, means of combination, means of abstraction
- Procedures and data. Abstraction blurs the difference
#+BEGIN_SRC emacs-lisp
  (message "Hello, Emacs!") ;; Cc Cc or Cx Ce to execute code blocks
  (+ 3 5)
  (* 34 4 31)
#+END_SRC

#+RESULTS:
: 4216

- Prefix notation; operand on the left
- Pretty printing
- Syntactic sugar
- Compound procedure
  - (define (<name> <formal parameters>) (body))
  - (define (square x) (* x x))
- Substitution model for procedure appliation
- Lambda calculus
  - Alpha conversion (renaming bound variable to avoid name collisions)
  - Beta reduction (substitution)
  - Eta conversion (functional equivalence)
- Conditional expressions and predicates
- (cond (⟨p1⟩ ⟨e1⟩)
  (⟨p2⟩ ⟨e2⟩)
  ...
  (⟨pn⟩ ⟨en⟩))  
- if (if ⟨predicate⟩ ⟨consequent⟩ ⟨alternative⟩)
- Compound predicates: and, or, not
- Square roots by Newton method (Heron of Alexandria, first century AD)
  - difference between declarative and imperative
  - difference between math (what is?) computer science (how to?)
  - if and new-if (by Alyssa P. Hacker) - compare and contrast results ($$)
- lexical scoping (bound and free variables)

